---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.NeverInOptionWarn
source: html/cbd7c394-a001-8aa2-06e9-f0308201d8bf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.NeverInOptionWarn Property

Some types of elements can't belong to an Option. Elements of these types were not added to this Option Set.

## Syntax (C#)
```csharp
public static FailureDefinitionId NeverInOptionWarn { get; }
```